app/Controllers/dosenController.php

SELECT `daftar_rps`.*, `mata_kuliah`.`nama_mk`, `jurusan`.`nama_jurusan`
FROM `daftar_rps`
JOIN `mata_kuliah` ON `mata_kuliah`.`kode_mk` = `daftar_rps`.`kode_mk`
JOIN `jurusan` ON `jurusan`.`id` = `daftar_rps`.`jurusan_id`
WHERE `daftar_rps`.`user_id` = '7'
SELECT *
FROM `unsur_rps`
SELECT *
FROM `review_rps`
WHERE `daftar_rps_id` = '12'
---
  public function feedback()
  {
    // Ambil ID dosen yang sedang login
    $dosenId = user_id();

    // Ambil daftar RPS dengan informasi lengkap
    $data['daftar_rps'] = $this->db->table('daftar_rps')
      ->select('daftar_rps.*, mata_kuliah.nama_mk, jurusan.nama_jurusan')
      ->join('mata_kuliah', 'mata_kuliah.kode_mk = daftar_rps.kode_mk')
      ->join('jurusan', 'jurusan.id = daftar_rps.jurusan_id')
      ->where('daftar_rps.user_id', $dosenId)
      ->get()
      ->getResult();

    // Ambil ID RPS yang dipilih dari query parameter
    $selectedRpsId = $this->request->getGet('rps_id');

    if ($selectedRpsId) {
      // Ambil semua unsur RPS
      $data['unsur_rps'] = $this->unsurModel->findAll();

      // Gunakan ReviewRpsModel untuk mengambil review dengan catatan
      $reviewModel = new \App\Models\ReviewRpsModel();
      $reviews = $reviewModel->where('daftar_rps_id', $selectedRpsId)->findAll();