app/Controllers/GpmController.php

  public function bap()
  {
    $data['mata_kuliah'] = $this->mataKuliahModel->findAll();

    // Tambahkan query untuk mendapatkan data lengkap
    $query = $this->db->table('bap')
      ->select('bap.*, mata_kuliah.nama_mk')
      ->join('mata_kuliah', 'mata_kuliah.kode_mk = bap.kode_mk')
      ->get();

    $data['bap_list'] = $query->getResultArray();

    // Ambil catatan review untuk setiap BAP
    if (!empty($data['bap_list'])) {
      foreach ($data['bap_list'] as &$bap) {
        $bap['catatan'] = $this->bapCatatanModel
          ->where('bap_id', $bap['id'])
          ->findAll();
---
SELECT *
FROM `mata_kuliah`
SELECT `bap`.*, `mata_kuliah`.`nama_mk`
FROM `bap`
JOIN `mata_kuliah` ON `mata_kuliah`.`kode_mk` = `bap`.`kode_mk`
SELECT *
FROM `bap_catatan`
WHERE `bap_id` = '3'

  public function getBapDetails($bapId)
  {
    try {
      $bapModel = new BapModel();
      $reviewNotesModel = new BapCatatanModel();
      $mataKuliahModel = new MataKuliahModel();


      $bap = $bapModel->find($bapId);

      if (!$bap) {
        return $this->response->setJSON([
          'success' => false,
          'message' => 'BAP tidak ditemukan'
        ]);
      }

      $mataKuliah = $mataKuliahModel->where('kode_mk', $bap['kode_mk'])->first();

      $reviewNotes = $reviewNotesModel->where('bap_id', $bapId)->findAll();
---
SELECT *
FROM `bap`
WHERE `bap`.`id` = '3'
SELECT *
FROM `mata_kuliah`
WHERE `kode_mk` = 'UNV12002'
 LIMIT 1
SELECT *
FROM `bap_catatan`
WHERE `bap_id` = '3'